aurelj/stm32f4xx-hal/src/qei.rs
#[cfg(feature = "stm32f1")]
impl Pins<TIM2> for (PA0<Input<Floating>>, PA1<Input<Floating>>) {
    fn remap() {
        let afio = unsafe { &(*AFIO::ptr()) };
        afio.mapr.modify(|_, w| unsafe { w.tim2_remap().bits(0b00) });
    }
}
#[cfg(feature = "stm32f1")]
impl Pins<TIM2> for (PA15<Input<Floating>>, PB3<Input<Floating>>) {
    fn remap() {
        let afio = unsafe { &(*AFIO::ptr()) };
        afio.mapr.modify(|_, w| unsafe { w.tim2_remap().bits(0b11) });
    }
}

#[cfg(feature = "stm32f1")]
impl Pins<TIM3> for (PA6<Input<Floating>>, PA7<Input<Floating>>) {
    fn remap() {
        let afio = unsafe { &(*AFIO::ptr()) };
        afio.mapr.modify(|_, w| unsafe { w.tim3_remap().bits(0b00) });
    }
}
#[cfg(feature = "stm32f1")]
impl Pins<TIM3> for (PC6<Input<Floating>>, PC7<Input<Floating>>) {
    fn remap() {
        let afio = unsafe { &(*AFIO::ptr()) };
        afio.mapr.modify(|_, w| unsafe { w.tim3_remap().bits(0b11) });
    }
}

#[cfg(feature = "stm32f1")]
impl Pins<TIM4> for (PB6<Input<Floating>>, PB7<Input<Floating>>) {
    fn remap() {
        let afio = unsafe { &(*AFIO::ptr()) };
        afio.mapr.modify(|_, w| w.tim4_remap().clear_bit() );
    }
}
#[cfg(any(
    feature = "stm32f100",
    feature = "stm32f101",
    feature = "stm32f103",
    feature = "stm32f105",
    feature = "stm32f107"
))]
impl Pins<TIM4> for (PD12<Input<Floating>>, PD13<Input<Floating>>) {
    fn remap() {
        let afio = unsafe { &(*AFIO::ptr()) };
        afio.mapr.modify(|_, w| w.tim4_remap().set_bit() );
    }
}

#[cfg(any(
    feature = "stm32f100",
    feature = "stm32f101",
    feature = "stm32f103",
    feature = "stm32f105",
    feature = "stm32f107"
))]
impl Pins<TIM5> for (PA0<Input<Floating>>, PA1<Input<Floating>>) {}

#[cfg(feature = "stm32f103")]
impl Pins<TIM8> for (PC6<Input<Floating>>, PC7<Input<Floating>>) {}

#[cfg(feature = "stm32f0")]
impl PinC1<TIM1> for PA8<Alternate<AF2>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC1<TIM1> for PA8<Alternate<AF1>> {}

#[cfg(feature = "stm32f0")]
impl PinC2<TIM1> for PA9<Alternate<AF2>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC2<TIM1> for PA9<Alternate<AF1>> {}

#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x2",
    feature = "stm32f0x8"
))]
impl PinC1<TIM1> for PE9<Alternate<AF0>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC1<TIM1> for PE9<Alternate<AF1>> {}

#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x2",
    feature = "stm32f0x8"
))]
impl PinC2<TIM1> for PE11<Alternate<AF0>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC2<TIM1> for PE11<Alternate<AF1>> {}

#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x2",
    feature = "stm32f0x8"
))]
impl PinC1<TIM2> for PA0<Alternate<AF2>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC1<TIM2> for PA0<Alternate<AF1>> {}

#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x2",
    feature = "stm32f0x8"
))]
impl PinC1<TIM2> for PA5<Alternate<AF2>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC1<TIM2> for PA5<Alternate<AF1>> {}

#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x2",
    feature = "stm32f0x8"
))]
impl PinC1<TIM2> for PA15<Alternate<AF2>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC1<TIM2> for PA15<Alternate<AF1>> {}

#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x2",
    feature = "stm32f0x8"
))]
impl PinC2<TIM2> for PA1<Alternate<AF2>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC2<TIM2> for PA1<Alternate<AF1>> {}

#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x2",
    feature = "stm32f0x8"
))]
impl PinC2<TIM2> for PB3<Alternate<AF2>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC2<TIM2> for PB3<Alternate<AF1>> {}

#[cfg(feature = "stm32f446")]
impl PinC1<TIM2> for PB8<Alternate<AF1>> {}

#[cfg(feature = "stm32f446")]
impl PinC2<TIM2> for PB9<Alternate<AF1>> {}

#[cfg(feature = "stm32f0")]
impl PinC1<TIM3> for PA6<Alternate<AF1>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC1<TIM3> for PA6<Alternate<AF2>> {}

#[cfg(feature = "stm32f0")]
impl PinC2<TIM3> for PA7<Alternate<AF1>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC2<TIM3> for PA7<Alternate<AF2>> {}

#[cfg(feature = "stm32f0")]
impl PinC1<TIM3> for PB4<Alternate<AF1>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC1<TIM3> for PB4<Alternate<AF2>> {}

#[cfg(feature = "stm32f0")]
impl PinC2<TIM3> for PB5<Alternate<AF1>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC2<TIM3> for PB5<Alternate<AF2>> {}

#[cfg(feature = "stm32f0")]
impl PinC1<TIM3> for PC6<Alternate<AF0>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC1<TIM3> for PC6<Alternate<AF2>> {}

#[cfg(feature = "stm32f0")]
impl PinC2<TIM3> for PC7<Alternate<AF0>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC2<TIM3> for PC7<Alternate<AF2>> {}

#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x2",
    feature = "stm32f0x8"
))]
impl PinC1<TIM3> for PE3<Alternate<AF0>> {}

#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x2",
    feature = "stm32f0x8"
))]
impl PinC2<TIM3> for PE4<Alternate<AF0>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC1<TIM4> for PB6<Alternate<AF2>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC2<TIM4> for PB7<Alternate<AF2>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC1<TIM4> for PD12<Alternate<AF2>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC2<TIM4> for PD13<Alternate<AF2>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC1<TIM5> for PA0<Alternate<AF2>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC2<TIM5> for PA1<Alternate<AF2>> {}

#[cfg(feature = "stm32f410")]
impl PinC1<TIM5> for PB12<Alternate<AF2>> {}

#[cfg(any(
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinC1<TIM5> for PF3<Alternate<AF2>> {}

#[cfg(any(
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinC2<TIM5> for PF4<Alternate<AF2>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC1<TIM5> for PH10<Alternate<AF2>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC2<TIM5> for PH11<Alternate<AF2>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC1<TIM8> for PC6<Alternate<AF3>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC2<TIM8> for PC7<Alternate<AF3>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC1<TIM8> for PI5<Alternate<AF3>> {}

#[cfg(any(
    feature = "stm32f2",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinC2<TIM8> for PI6<Alternate<AF3>> {}

/// Hardware quadrature encoder interface peripheral
pub struct Qei<TIM, PINS> {
    tim: TIM,
    pins: PINS,
}

macro_rules! hal {
    ($($TIM:ident: ($tim:ident, $timXen:ident, $timXrst:ident, $apbenr:ident, $apbrstr:ident, $bits:ident),)+) => {
        $(
            impl<PINS> Qei<$TIM, PINS> {
                /// Configures a TIM peripheral as a quadrature encoder interface input
                pub fn $tim(tim: $TIM, pins: PINS) -> Self
                where
                    PINS: Pins<$TIM>
                {
                    let rcc = unsafe { &(*RCC::ptr()) };
                    // enable and reset peripheral to a clean slate state
                    rcc.$apbenr.modify(|_, w| w.$timXen().set_bit());
                    rcc.$apbrstr.modify(|_, w| w.$timXrst().set_bit());
                    rcc.$apbrstr.modify(|_, w| w.$timXrst().clear_bit());

